#+TITLE: My Emacs Configuration
#+AUTHOR: Alex Vandenberg
#+EMAIL: a.vandenberg0175@gmail.com

** Window Managment
#+begin_src emacs-lisp
  (use-package window
    ;; Built-in. Dont load with package.el
    :ensure nil
    :custom
    ;; Change window selection
    (display-buffer-base-action
      '(display-buffer-same-window
	display-buffer-reuse-mode-window
	display-buffer-reuse-window))
    (display-buffer-alist
     '(
       ("\\*Org Select\\*"
	(display-buffer-in-side-window)
	(window-height . 0.25)
	(side . bottom)
	(slot . 0))
       ("\\*org-roam\\*"
	(display-buffer-in-side-window)
	(window-height . 0.25)
	(side . bottom)
	(slot . 1))
       ("\\*help\\*"
	(display-buffer-in-side-window)
	(window-height . 0.25)
	(side . bottom)
	(slot . 0))
       ("\\*Warnings\\*"
	(display-buffer-in-side-window)
	(window-height . 0.25)
	(side . bottom)
	(slot . 3))
       ("CAPTURE-*"
	(display-buffer-in-side-window)
	(window-height . 0.25)
	(side . bottom)
	(slot . 2))
      )
    )
  )

  ;; If a popup does happen, don't resize windows to be equal-sized
  (setq even-window-sizes nil)

  ;; Auto select help window when it opens
  (setq help-window-select t)

  ;; Follow links in same window instead of new one.
  ;; Does not change behavior of other commands that make new windows.
  (add-to-list 'org-link-frame-setup '(file . find-file))
#+end_src

#+RESULTS:
: ((file . find-file) (vm . vm-visit-folder-other-frame) (vm-imap . vm-visit-imap-folder-other-frame) (gnus . org-gnus-no-new-news) (file . find-file-other-window) (wl . wl-other-frame))

*** Error when compiling
java.lang.RuntimeException: SDK location not found. Define location with sdk.dir in the local.properties file or with an ANDROID_HOME environment variable.

#+begin_src emacs-lisp
  ;;  (setenv "JAVA_HOME" "/usr/lib/jvm/java-14-openjdk-amd64")
  (setenv "ANDROID_HOME" "~/Android/Sdk/")
  (setq lsp-java-vmargs '("-XX:+UseParallelGC" "-XX:GCTimeRatio=4" "-XX:AdaptiveSizePolicyWeight=90" "-Dsun.zip.disableMemoryMapping=true" "-Xmx2G" "-Xms100m"))
#+end_src

#+RESULTS:
: ~/Android/Sdk

